MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
extern volatile ADTBL3BITS ADTBL3bits __attribute__((__sfr__));

#define ADTBL4 ADTBL4
extern volatile uint16_t ADTBL4 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL4BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL4BITS;
extern volatile ADTBL4BITS ADTBL4bits __attribute__((__sfr__));

#define ADTBL5 ADTBL5
extern volatile uint16_t ADTBL5 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL5BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL5BITS;
extern volatile ADTBL5BITS ADTBL5bits __attribute__((__sfr__));

#define ADTBL6 ADTBL6
extern volatile uint16_t ADTBL6 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL6BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL6BITS;
extern volatile ADTBL6BITS ADTBL6bits __attribute__((__sfr__));

#define ADTBL7 ADTBL7
extern volatile uint16_t ADTBL7 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL7BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL7BITS;
extern volatile ADTBL7BITS ADTBL7bits __attribute__((__sfr__));

#define ADTBL8 ADTBL8
extern volatile uint16_t ADTBL8 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL8BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL8BITS;
extern volatile ADTBL8BITS ADTBL8bits __attribute__((__sfr__));

#define ADTBL9 ADTBL9
extern volatile uint16_t ADTBL9 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL9BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL9BITS;
extern volatile ADTBL9BITS ADTBL9bits __attribute__((__sfr__));

#define ADTBL10 ADTBL10
extern volatile uint16_t ADTBL10 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL10BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL10BITS;
extern volatile ADTBL10BITS ADTBL10bits __attribute__((__sfr__));

#define ADTBL11 ADTBL11
extern volatile uint16_t ADTBL11 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL11BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL11BITS;
extern volatile ADTBL11BITS ADTBL11bits __attribute__((__sfr__));

#define ADTBL12 ADTBL12
extern volatile uint16_t ADTBL12 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL12BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL12BITS;
extern volatile ADTBL12BITS ADTBL12bits __attribute__((__sfr__));

#define ADTBL13 ADTBL13
extern volatile uint16_t ADTBL13 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL13BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL13BITS;
extern volatile ADTBL13BITS ADTBL13bits __attribute__((__sfr__));

#define ADTBL14 ADTBL14
extern volatile uint16_t ADTBL14 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL14BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL14BITS;
extern volatile ADTBL14BITS ADTBL14bits __attribute__((__sfr__));

#define ADTBL15 ADTBL15
extern volatile uint16_t ADTBL15 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL15BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL15BITS;
extern volatile ADTBL15BITS ADTBL15bits __attribute__((__sfr__));

