MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
#define DMAINT2 DMAINT2
extern volatile uint16_t DMAINT2 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT2BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT2BITS;
extern volatile DMAINT2BITS DMAINT2bits __attribute__((__sfr__));

#define DMASRC2 DMASRC2
extern volatile uint16_t DMASRC2 __attribute__((__sfr__));
#define DMADST2 DMADST2
extern volatile uint16_t DMADST2 __attribute__((__sfr__));
#define DMACNT2 DMACNT2
extern volatile uint16_t DMACNT2 __attribute__((__sfr__));
#define DMACH3 DMACH3
extern volatile uint16_t DMACH3 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH3BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH3BITS;
extern volatile DMACH3BITS DMACH3bits __attribute__((__sfr__));

#define DMAINT3 DMAINT3
extern volatile uint16_t DMAINT3 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT3BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT3BITS;
extern volatile DMAINT3BITS DMAINT3bits __attribute__((__sfr__));

#define DMASRC3 DMASRC3
extern volatile uint16_t DMASRC3 __attribute__((__sfr__));
#define DMADST3 DMADST3
extern volatile uint16_t DMADST3 __attribute__((__sfr__));
#define DMACNT3 DMACNT3
extern volatile uint16_t DMACNT3 __attribute__((__sfr__));
#define DMACH4 DMACH4
extern volatile uint16_t DMACH4 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH4BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH4BITS;
extern volatile DMACH4BITS DMACH4bits __attribute__((__sfr__));

#define DMAINT4 DMAINT4
extern volatile uint16_t DMAINT4 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT4BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT4BITS;
extern volatile DMAINT4BITS DMAINT4bits __attribute__((__sfr__));

#define DMASRC4 DMASRC4
extern volatile uint16_t DMASRC4 __attribute__((__sfr__));
#define DMADST4 DMADST4
extern volatile uint16_t DMADST4 __attribute__((__sfr__));
#define DMACNT4 DMACNT4
extern volatile uint16_t DMACNT4 __attribute__((__sfr__));
#define DMACH5 DMACH5
extern volatile uint16_t DMACH5 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH5BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH5BITS;
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile uint16_t DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile uint16_t DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile uint16_t DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile uint16_t DMACNT5 __attribute__((__sfr__));
#define ADL3CON ADL3CON
extern volatile uint32_t ADL3CON __attribute__((__sfr__));
#define ADL3CONL ADL3CONL
extern volatile uint16_t ADL3CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONLBITS {
  union {
    struct {
      uint16_t SLSIZE:6;
      uint16_t :1;
      uint16_t THSRC:1;
      uint16_t SLTSRC:5;
      uint16_t SLENCLR:1;
      uint16_t SAMP:1;
      uint16_t SLEN:1;
    };
    struct {
      uint16_t SLSIZE0:1;
      uint16_t SLSIZE1:1;
      uint16_t SLSIZE2:1;
      uint16_t SLSIZE3:1;
      uint16_t SLSIZE4:1;
      uint16_t SLSIZE5:1;
      uint16_t :2;
      uint16_t SLTSRC0:1;
      uint16_t SLTSRC1:1;
      uint16_t SLTSRC2:1;
      uint16_t SLTSRC3:1;
      uint16_t SLTSRC4:1;
    };
  };
} ADL3CONLBITS;
extern volatile ADL3CONLBITS ADL3CONLbits __attribute__((__sfr__));

#define ADL3CONH ADL3CONH
extern volatile uint16_t ADL3CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONHBITS {
  union {
    struct {
      uint16_t SAMC:5;
      uint16_t MULCHEN:1;
      uint16_t :1;
      uint16_t CTMEN:1;
      uint16_t CM:3;
      uint16_t WM:2;
      uint16_t SLINT:2;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t :3;
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t CM2:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t SLINT0:1;
      uint16_t SLINT1:1;
    };
  };
} ADL3CONHBITS;
extern volatile ADL3CONHBITS ADL3CONHbits __attribute__((__sfr__));

#define ADL3PTR ADL3PTR
extern volatile uint16_t ADL3PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL3PTRBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADNEXT:7;
    };
    struct {
      uint16_t :8;
      uint16_t ADNEXT0:1;
      uint16_t ADNEXT1:1;
      uint16_t ADNEXT2:1;
      uint16_t ADNEXT3:1;
      uint16_t ADNEXT4:1;
      uint16_t ADNEXT5:1;
      uint16_t ADNEXT6:1;
    };
  };
} ADL3PTRBITS;
extern volatile ADL3PTRBITS ADL3PTRbits __attribute__((__sfr__));

#define ADL3STAT ADL3STAT
extern volatile uint16_t ADL3STAT __attribute__((__sfr__));
typedef struct tagADL3STATBITS {
  uint16_t :5;
  uint16_t ADLIF:1;
  uint16_t :1;
  uint16_t ADTDLY:1;
  uint16_t :6;
  uint16_t LBUSY:1;
  uint16_t ADTACT:1;
} ADL3STATBITS;
extern volatile ADL3STATBITS ADL3STATbits __attribute__((__sfr__));

