MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
#define ADTH3L ADTH3L
extern volatile uint16_t ADTH3L __attribute__((__sfr__));
typedef struct tagADTH3LBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH3LBITS;
extern volatile ADTH3LBITS ADTH3Lbits __attribute__((__sfr__));

#define ADTH3H ADTH3H
extern volatile uint16_t ADTH3H __attribute__((__sfr__));
typedef struct tagADTH3HBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH3HBITS;
extern volatile ADTH3HBITS ADTH3Hbits __attribute__((__sfr__));

#define ADL3MSEL ADL3MSEL
extern volatile uint64_t ADL3MSEL __attribute__((__sfr__));
#define ADL3MSEL0 ADL3MSEL0
extern volatile uint16_t ADL3MSEL0 __attribute__((__sfr__));
typedef struct tagADL3MSEL0BITS {
  uint16_t :15;
  uint16_t MSEL15:1;
} ADL3MSEL0BITS;
extern volatile ADL3MSEL0BITS ADL3MSEL0bits __attribute__((__sfr__));

#define ADL3MSEL1 ADL3MSEL1
extern volatile uint16_t ADL3MSEL1 __attribute__((__sfr__));
typedef struct tagADL3MSEL1BITS {
  uint16_t MSEL16:1;
  uint16_t MSEL17:1;
  uint16_t MSEL18:1;
  uint16_t MSEL19:1;
  uint16_t MSEL20:1;
  uint16_t MSEL21:1;
  uint16_t MSEL22:1;
  uint16_t MSEL23:1;
  uint16_t MSEL24:1;
  uint16_t MSEL25:1;
  uint16_t MSEL26:1;
  uint16_t MSEL27:1;
  uint16_t MSEL28:1;
  uint16_t MSEL29:1;
  uint16_t MSEL30:1;
  uint16_t MSEL31:1;
} ADL3MSEL1BITS;
extern volatile ADL3MSEL1BITS ADL3MSEL1bits __attribute__((__sfr__));

#define ADL3MSEL2 ADL3MSEL2
extern volatile uint16_t ADL3MSEL2 __attribute__((__sfr__));
typedef struct tagADL3MSEL2BITS {
  uint16_t MSEL32:1;
  uint16_t MSEL33:1;
  uint16_t MSEL34:1;
  uint16_t MSEL35:1;
  uint16_t MSEL36:1;
  uint16_t MSEL37:1;
  uint16_t MSEL38:1;
  uint16_t MSEL39:1;
  uint16_t MSEL40:1;
  uint16_t MSEL41:1;
  uint16_t MSEL42:1;
  uint16_t MSEL43:1;
  uint16_t MSEL44:1;
  uint16_t MSEL45:1;
  uint16_t MSEL46:1;
  uint16_t MSEL47:1;
} ADL3MSEL2BITS;
extern volatile ADL3MSEL2BITS ADL3MSEL2bits __attribute__((__sfr__));

#define ADL3MSEL3 ADL3MSEL3
extern volatile uint16_t ADL3MSEL3 __attribute__((__sfr__));
typedef struct tagADL3MSEL3BITS {
  uint16_t MSEL48:1;
  uint16_t MSEL49:1;
} ADL3MSEL3BITS;
extern volatile ADL3MSEL3BITS ADL3MSEL3bits __attribute__((__sfr__));

#define DAC1CON DAC1CON
extern volatile uint16_t DAC1CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t :1;
      uint16_t DACTRIG:1;
      uint16_t :2;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC1CONBITS;
extern volatile DAC1CONBITS DAC1CONbits __attribute__((__sfr__));

#define DAC1DAT DAC1DAT
extern volatile uint16_t DAC1DAT __attribute__((__sfr__));
#define DAC2CON DAC2CON
extern volatile uint16_t DAC2CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t :1;
      uint16_t DACTRIG:1;
      uint16_t :2;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC2CONBITS;
extern volatile DAC2CONBITS DAC2CONbits __attribute__((__sfr__));

#define DAC2DAT DAC2DAT
extern volatile uint16_t DAC2DAT __attribute__((__sfr__));
#define U1OTGIR U1OTGIR
extern volatile uint16_t U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  uint16_t VBUSVDIF:1;
  uint16_t :1;
  uint16_t SESENDIF:1;
  uint16_t SESVDIF:1;
  uint16_t ACTVIF:1;
  uint16_t LSTATEIF:1;
  uint16_t T1MSECIF:1;
  uint16_t IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile uint16_t U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  uint16_t VBUSVDIE:1;
  uint16_t :1;
  uint16_t SESENDIE:1;
  uint16_t SESVDIE:1;
  uint16_t ACTVIE:1;
  uint16_t LSTATEIE:1;
  uint16_t T1MSECIE:1;
  uint16_t IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile uint16_t U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  uint16_t VBUSVD:1;
  uint16_t :1;
  uint16_t SESEND:1;
  uint16_t SESVD:1;
  uint16_t :1;
  uint16_t LSTATE:1;
  uint16_t :1;
  uint16_t ID:1;
} U1OTGSTATBITS;
extern volatile U1OTGSTATBITS U1OTGSTATbits __attribute__((__sfr__));

#define U1OTGCON U1OTGCON
extern volatile uint16_t U1OTGCON __attribute__((__sfr__));
typedef struct tagU1OTGCONBITS {
  uint16_t VBUSDIS:1;
  uint16_t VBUSCHG:1;
  uint16_t OTGEN:1;
  uint16_t :1;
  uint16_t DMPULDWN:1;
  uint16_t DPPULDWN:1;
  uint16_t DMPULUP:1;
  uint16_t DPPULUP:1;
} U1OTGCONBITS;
extern volatile U1OTGCONBITS U1OTGCONbits __attribute__((__sfr__));

#define U1PWRC U1PWRC
extern volatile uint16_t U1PWRC __attribute__((__sfr__));
__extension__ typedef struct tagU1PWRCBITS {
  union {
    struct {
      uint16_t USBPWR:1;
      uint16_t USUSPND:1;
      uint16_t :2;
      uint16_t USLPGRD:1;
      uint16_t :2;
      uint16_t UACTPND:1;
    };
    struct {
      uint16_t :1;
      uint16_t USUSPEND:1;
    };
  };
} U1PWRCBITS;
extern volatile U1PWRCBITS U1PWRCbits __attribute__((__sfr__));

#define U1IR U1IR
extern volatile uint16_t U1IR __attribute__((__sfr__));
__extension__ typedef struct tagU1IRBITS {
  union {
    struct {
      uint16_t URSTIF:1;
      uint16_t UERRIF:1;
      uint16_t SOFIF:1;
      uint16_t TRNIF:1;
      uint16_t IDLEIF:1;
      uint16_t RESUMEIF:1;
      uint16_t ATTACHIF:1;
      uint16_t STALLIF:1;
    };
    struct {
      uint16_t DETACHIF:1;
    };
  };
} U1IRBITS;
extern volatile U1IRBITS U1IRbits __attribute__((__sfr__));

#define U1IE U1IE
extern volatile uint16_t U1IE __attribute__((__sfr__));
__extension__ typedef struct tagU1IEBITS {
  union {
    struct {
      uint16_t URSTIE:1;
      uint16_t UERRIE:1;
      uint16_t SOFIE:1;
      uint16_t TRNIE:1;
      uint16_t IDLEIE:1;
      uint16_t RESUMEIE:1;
      uint16_t ATTACHIE:1;
      uint16_t STALLIE:1;
    };
    struct {
      uint16_t DETACHIE:1;
    };
  };
} U1IEBITS;
