MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
#define SD1RESH SD1RESH
extern volatile uint16_t SD1RESH __attribute__((__sfr__));
#define SD1RESL SD1RESL
extern volatile uint16_t SD1RESL __attribute__((__sfr__));
#define ANCFG ANCFG
extern volatile uint16_t ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  uint16_t :2;
  uint16_t VBG2EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t :4;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t :4;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t :4;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t :4;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
#define ANSD ANSD
extern volatile uint16_t ANSD __attribute__((__sfr__));
__extension__ typedef struct tagANSDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSDBITS;
extern volatile ANSDBITS ANSDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
__extension__ typedef struct tagANSELDBITS {
  union {
    struct {
      uint16_t ANSD0:1;
      uint16_t ANSD1:1;
      uint16_t ANSD2:1;
      uint16_t ANSD3:1;
      uint16_t ANSD4:1;
      uint16_t ANSD5:1;
      uint16_t ANSD6:1;
      uint16_t ANSD7:1;
      uint16_t ANSD8:1;
      uint16_t ANSD9:1;
      uint16_t ANSD10:1;
      uint16_t ANSD11:1;
      uint16_t ANSD12:1;
      uint16_t ANSD13:1;
      uint16_t ANSD14:1;
      uint16_t ANSD15:1;
    };
    struct {
      uint16_t ANSELD0:1;
      uint16_t ANSELD1:1;
      uint16_t ANSELD2:1;
      uint16_t ANSELD3:1;
      uint16_t ANSELD4:1;
      uint16_t ANSELD5:1;
      uint16_t ANSELD6:1;
      uint16_t ANSELD7:1;
      uint16_t ANSELD8:1;
      uint16_t ANSELD9:1;
      uint16_t ANSELD10:1;
      uint16_t ANSELD11:1;
      uint16_t ANSELD12:1;
      uint16_t ANSELD13:1;
      uint16_t ANSELD14:1;
      uint16_t ANSELD15:1;
    };
  };
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile uint16_t ANSE __attribute__((__sfr__));
__extension__ typedef struct tagANSEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
__extension__ typedef struct tagANSELEBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
__extension__ typedef struct tagANSELFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t :2;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :1;
      uint16_t ANSF7:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t :2;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :1;
      uint16_t ANSELF7:1;
    };
  };
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define ANSF ANSF
extern volatile uint16_t ANSF __attribute__((__sfr__));
__extension__ typedef struct tagANSFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t :2;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :1;
      uint16_t ANSF7:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t :2;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :1;
      uint16_t ANSELF7:1;
    };
  };
} ANSFBITS;
