MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
extern volatile ANSFBITS ANSFbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
__extension__ typedef struct tagANSELGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define ANSG ANSG
extern volatile uint16_t ANSG __attribute__((__sfr__));
__extension__ typedef struct tagANSGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSGBITS;
extern volatile ANSGBITS ANSGbits __attribute__((__sfr__));

#define ADCON1 ADCON1
extern volatile uint16_t ADCON1 __attribute__((__sfr__));
__extension__ typedef struct tagADCON1BITS {
  union {
    struct {
      uint16_t PWRLVL:1;
      uint16_t :5;
      uint16_t ADCAL:1;
      uint16_t PUMPEN:1;
      uint16_t FORM:4;
      uint16_t ADSLP:1;
      uint16_t ADSIDL:1;
      uint16_t :1;
      uint16_t ADON:1;
    };
    struct {
      uint16_t :8;
      uint16_t FORM0:1;
      uint16_t FORM1:1;
      uint16_t FORM2:1;
      uint16_t FORM3:1;
    };
  };
} ADCON1BITS;
extern volatile ADCON1BITS ADCON1bits __attribute__((__sfr__));

#define ADCON2 ADCON2
extern volatile uint16_t ADCON2 __attribute__((__sfr__));
__extension__ typedef struct tagADCON2BITS {
  union {
    struct {
      uint16_t :1;
      uint16_t REFPUMP:1;
      uint16_t :8;
      uint16_t BUFORG:1;
      uint16_t :1;
      uint16_t NVCFG0:1;
      uint16_t :1;
      uint16_t PVCFG:2;
    };
    struct {
      uint16_t :12;
      uint16_t NVCFG:1;
      uint16_t :1;
      uint16_t PVCFG0:1;
      uint16_t PVCFG1:1;
    };
    struct {
      uint16_t :1;
      uint16_t RFPUMP:1;
    };
  };
} ADCON2BITS;
extern volatile ADCON2BITS ADCON2bits __attribute__((__sfr__));

#define ADCON3 ADCON3
extern volatile uint16_t ADCON3 __attribute__((__sfr__));
__extension__ typedef struct tagADCON3BITS {
  union {
    struct {
      uint16_t ADCS:8;
      uint16_t :7;
      uint16_t ADRC:1;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t ADCS7:1;
    };
    struct {
      uint16_t :8;
      uint16_t SLEN:4;
    };
    struct {
      uint16_t :8;
      uint16_t SLEN0:1;
      uint16_t SLEN1:1;
      uint16_t SLEN2:1;
      uint16_t SLEN3:1;
    };
  };
} ADCON3BITS;
extern volatile ADCON3BITS ADCON3bits __attribute__((__sfr__));

#define ADTMRPR ADTMRPR
extern volatile uint16_t ADTMRPR __attribute__((__sfr__));
#define ADSTAT ADSTAT
extern volatile uint32_t ADSTAT __attribute__((__sfr__));
#define ADSTATL ADSTATL
extern volatile uint16_t ADSTATL __attribute__((__sfr__));
__extension__ typedef struct tagADSTATLBITS {
  union {
    struct {
      uint16_t SL0IF:1;
      uint16_t SL1IF:1;
      uint16_t SL2IF:1;
      uint16_t SL3IF:1;
      uint16_t ACCIF:1;
      uint16_t BUFIF:1;
      uint16_t :2;
      uint16_t SLERR:4;
    };
    struct {
      uint16_t :8;
      uint16_t SLERR0:1;
      uint16_t SLERR1:1;
      uint16_t SLERR2:1;
      uint16_t SLERR3:1;
    };
    struct {
      uint16_t :8;
      uint16_t SLOV:1;
    };
  };
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADSTATH ADSTATH
extern volatile uint16_t ADSTATH __attribute__((__sfr__));
typedef struct tagADSTATHBITS {
  uint16_t ADBUSY:1;
  uint16_t ADREADY:1;
  uint16_t PUMPST:1;
} ADSTATHBITS;
extern volatile ADSTATHBITS ADSTATHbits __attribute__((__sfr__));

#define ACCON ACCON
extern volatile uint32_t ACCON __attribute__((__sfr__));
#define ACCONL ACCONL
extern volatile uint16_t ACCONL __attribute__((__sfr__));
__extension__ typedef struct tagACCONLBITS {
  union {
    struct {
      uint16_t COUNT:8;
      uint16_t TBLSEL:6;
    };
    struct {
      uint16_t COUNT0:1;
      uint16_t COUNT1:1;
      uint16_t COUNT2:1;
      uint16_t COUNT3:1;
      uint16_t COUNT4:1;
      uint16_t COUNT5:1;
      uint16_t COUNT6:1;
      uint16_t COUNT7:1;
      uint16_t TBLSEL0:1;
      uint16_t TBLSEL1:1;
      uint16_t TBLSEL2:1;
      uint16_t TBLSEL3:1;
      uint16_t TBLSEL4:1;
      uint16_t TBLSEL5:1;
    };
  };
} ACCONLBITS;
extern volatile ACCONLBITS ACCONLbits __attribute__((__sfr__));

#define ACCONH ACCONH
extern volatile uint16_t ACCONH __attribute__((__sfr__));
typedef struct tagACCONHBITS {
  uint16_t :6;
  uint16_t ACIE:1;
  uint16_t ACEN:1;
} ACCONHBITS;
extern volatile ACCONHBITS ACCONHbits __attribute__((__sfr__));

#define ACRES ACRES
extern volatile uint32_t ACRES __attribute__((__sfr__));
#define ACRESL ACRESL
extern volatile uint16_t ACRESL __attribute__((__sfr__));
#define ACRESH ACRESH
extern volatile uint16_t ACRESH __attribute__((__sfr__));
#define ADCHIT ADCHIT
extern volatile uint32_t ADCHIT __attribute__((__sfr__));
#define ADCHITL ADCHITL
extern volatile uint16_t ADCHITL __attribute__((__sfr__));
typedef struct tagADCHITLBITS {
  uint16_t CHH0:1;
  uint16_t CHH1:1;
  uint16_t CHH2:1;
  uint16_t CHH3:1;
  uint16_t CHH4:1;
  uint16_t CHH5:1;
  uint16_t CHH6:1;
  uint16_t CHH7:1;
  uint16_t CHH8:1;
  uint16_t CHH9:1;
  uint16_t CHH10:1;
  uint16_t CHH11:1;
  uint16_t CHH12:1;
  uint16_t CHH13:1;
  uint16_t CHH14:1;
  uint16_t CHH15:1;
} ADCHITLBITS;
extern volatile ADCHITLBITS ADCHITLbits __attribute__((__sfr__));

#define ADCHITH ADCHITH
extern volatile uint16_t ADCHITH __attribute__((__sfr__));
typedef struct tagADCHITHBITS {
  uint16_t CHH16:1;
  uint16_t CHH17:1;
  uint16_t CHH18:1;
  uint16_t CHH19:1;
  uint16_t CHH20:1;
  uint16_t CHH21:1;
  uint16_t CHH22:1;
  uint16_t CHH23:1;
  uint16_t CHH24:1;
  uint16_t CHH25:1;
  uint16_t CHH26:1;
  uint16_t CHH27:1;
  uint16_t CHH28:1;
  uint16_t CHH29:1;
  uint16_t CHH30:1;
  uint16_t CHH31:1;
} ADCHITHBITS;
extern volatile ADCHITHBITS ADCHITHbits __attribute__((__sfr__));

#define ADL0CON ADL0CON
extern volatile uint32_t ADL0CON __attribute__((__sfr__));
#define ADL0CONL ADL0CONL
extern volatile uint16_t ADL0CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL0CONLBITS {
  union {
    struct {
      uint16_t SLSIZE:6;
      uint16_t :1;
      uint16_t THSRC:1;
      uint16_t SLTSRC:5;
      uint16_t SLENCLR:1;
      uint16_t SAMP:1;
      uint16_t SLEN:1;
    };
    struct {
      uint16_t SLSIZE0:1;
      uint16_t SLSIZE1:1;
      uint16_t SLSIZE2:1;
      uint16_t SLSIZE3:1;
      uint16_t SLSIZE4:1;
      uint16_t SLSIZE5:1;
      uint16_t :2;
      uint16_t SLTSRC0:1;
      uint16_t SLTSRC1:1;
      uint16_t SLTSRC2:1;
      uint16_t SLTSRC3:1;
      uint16_t SLTSRC4:1;
    };
  };
} ADL0CONLBITS;
extern volatile ADL0CONLBITS ADL0CONLbits __attribute__((__sfr__));

