MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
/* ADL3CONH */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _MULCHEN cannot be defined because it is used by more than one SFR */
/* Bitname _CTMEN cannot be defined because it is used by more than one SFR */
/* Bitname _CM cannot be defined because it is used by more than one SFR */
/* Bitname _WM cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEN cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _CM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CM2 cannot be defined because it is used by more than one SFR */
/* Bitname _WM0 cannot be defined because it is used by more than one SFR */
/* Bitname _WM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLINT1 cannot be defined because it is used by more than one SFR */

/* ADL3PTR */
/* Bitname _ADNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADNEXT6 cannot be defined because it is used by more than one SFR */

/* ADL3STAT */
/* Bitname _ADLIF cannot be defined because it is used by more than one SFR */
/* Bitname _ADTDLY cannot be defined because it is used by more than one SFR */
/* Bitname _LBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _ADTACT cannot be defined because it is used by more than one SFR */

/* ADTH3L */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADTH3H */
/* Bitname _TH0 cannot be defined because it is used by more than one SFR */
/* Bitname _TH1 cannot be defined because it is used by more than one SFR */
/* Bitname _TH2 cannot be defined because it is used by more than one SFR */
/* Bitname _TH3 cannot be defined because it is used by more than one SFR */
/* Bitname _TH4 cannot be defined because it is used by more than one SFR */
/* Bitname _TH5 cannot be defined because it is used by more than one SFR */
/* Bitname _TH6 cannot be defined because it is used by more than one SFR */
/* Bitname _TH7 cannot be defined because it is used by more than one SFR */
/* Bitname _TH8 cannot be defined because it is used by more than one SFR */
/* Bitname _TH9 cannot be defined because it is used by more than one SFR */
/* Bitname _TH10 cannot be defined because it is used by more than one SFR */
/* Bitname _TH11 cannot be defined because it is used by more than one SFR */
/* Bitname _TH12 cannot be defined because it is used by more than one SFR */
/* Bitname _TH13 cannot be defined because it is used by more than one SFR */
/* Bitname _TH14 cannot be defined because it is used by more than one SFR */
/* Bitname _TH15 cannot be defined because it is used by more than one SFR */

/* ADL3MSEL0 */
/* Bitname _MSEL15 cannot be defined because it is used by more than one SFR */

/* ADL3MSEL1 */
/* Bitname _MSEL16 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL17 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL18 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL19 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL20 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL21 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL22 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL23 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL24 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL25 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL26 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL27 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL28 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL29 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL30 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL31 cannot be defined because it is used by more than one SFR */

/* ADL3MSEL2 */
/* Bitname _MSEL32 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL33 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL34 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL35 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL36 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL37 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL38 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL39 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL40 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL41 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL42 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL43 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL44 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL45 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL46 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL47 cannot be defined because it is used by more than one SFR */

/* ADL3MSEL3 */
/* Bitname _MSEL48 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL49 cannot be defined because it is used by more than one SFR */

/* DAC1CON */
/* Bitname _DACREF cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DACTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _DACFM cannot be defined because it is used by more than one SFR */
/* Bitname _DACSLP cannot be defined because it is used by more than one SFR */
/* Bitname _DACSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL4 cannot be defined because it is used by more than one SFR */

/* DAC2CON */
/* Bitname _DACREF cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DACTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _DACFM cannot be defined because it is used by more than one SFR */
/* Bitname _DACSLP cannot be defined because it is used by more than one SFR */
/* Bitname _DACSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _REFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACTSEL4 cannot be defined because it is used by more than one SFR */

