MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
#define _ADL1CONH_ASEN_POSITION                  0x0000000F
#define _ADL1CONH_ASEN_MASK                      0x00008000
#define _ADL1CONH_ASEN_LENGTH                    0x00000001

#define _ADL1CONH_SAMC0_POSITION                 0x00000000
#define _ADL1CONH_SAMC0_MASK                     0x00000001
#define _ADL1CONH_SAMC0_LENGTH                   0x00000001

#define _ADL1CONH_SAMC1_POSITION                 0x00000001
#define _ADL1CONH_SAMC1_MASK                     0x00000002
#define _ADL1CONH_SAMC1_LENGTH                   0x00000001

#define _ADL1CONH_SAMC2_POSITION                 0x00000002
#define _ADL1CONH_SAMC2_MASK                     0x00000004
#define _ADL1CONH_SAMC2_LENGTH                   0x00000001

#define _ADL1CONH_SAMC3_POSITION                 0x00000003
#define _ADL1CONH_SAMC3_MASK                     0x00000008
#define _ADL1CONH_SAMC3_LENGTH                   0x00000001

#define _ADL1CONH_SAMC4_POSITION                 0x00000004
#define _ADL1CONH_SAMC4_MASK                     0x00000010
#define _ADL1CONH_SAMC4_LENGTH                   0x00000001

#define _ADL1CONH_CM0_POSITION                   0x00000008
#define _ADL1CONH_CM0_MASK                       0x00000100
#define _ADL1CONH_CM0_LENGTH                     0x00000001

#define _ADL1CONH_CM1_POSITION                   0x00000009
#define _ADL1CONH_CM1_MASK                       0x00000200
#define _ADL1CONH_CM1_LENGTH                     0x00000001

#define _ADL1CONH_CM2_POSITION                   0x0000000A
#define _ADL1CONH_CM2_MASK                       0x00000400
#define _ADL1CONH_CM2_LENGTH                     0x00000001

#define _ADL1CONH_WM0_POSITION                   0x0000000B
#define _ADL1CONH_WM0_MASK                       0x00000800
#define _ADL1CONH_WM0_LENGTH                     0x00000001

#define _ADL1CONH_WM1_POSITION                   0x0000000C
#define _ADL1CONH_WM1_MASK                       0x00001000
#define _ADL1CONH_WM1_LENGTH                     0x00000001

#define _ADL1CONH_SLINT0_POSITION                0x0000000D
#define _ADL1CONH_SLINT0_MASK                    0x00002000
#define _ADL1CONH_SLINT0_LENGTH                  0x00000001

#define _ADL1CONH_SLINT1_POSITION                0x0000000E
#define _ADL1CONH_SLINT1_MASK                    0x00004000
#define _ADL1CONH_SLINT1_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT_POSITION                 0x00000008
#define _ADL1PTR_ADNEXT_MASK                     0x00007F00
#define _ADL1PTR_ADNEXT_LENGTH                   0x00000007

#define _ADL1PTR_ADNEXT0_POSITION                0x00000008
#define _ADL1PTR_ADNEXT0_MASK                    0x00000100
#define _ADL1PTR_ADNEXT0_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT1_POSITION                0x00000009
#define _ADL1PTR_ADNEXT1_MASK                    0x00000200
#define _ADL1PTR_ADNEXT1_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT2_POSITION                0x0000000A
#define _ADL1PTR_ADNEXT2_MASK                    0x00000400
#define _ADL1PTR_ADNEXT2_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT3_POSITION                0x0000000B
#define _ADL1PTR_ADNEXT3_MASK                    0x00000800
#define _ADL1PTR_ADNEXT3_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT4_POSITION                0x0000000C
#define _ADL1PTR_ADNEXT4_MASK                    0x00001000
#define _ADL1PTR_ADNEXT4_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT5_POSITION                0x0000000D
#define _ADL1PTR_ADNEXT5_MASK                    0x00002000
#define _ADL1PTR_ADNEXT5_LENGTH                  0x00000001

#define _ADL1PTR_ADNEXT6_POSITION                0x0000000E
#define _ADL1PTR_ADNEXT6_MASK                    0x00004000
#define _ADL1PTR_ADNEXT6_LENGTH                  0x00000001

#define _ADL1STAT_ADLIF_POSITION                 0x00000005
#define _ADL1STAT_ADLIF_MASK                     0x00000020
#define _ADL1STAT_ADLIF_LENGTH                   0x00000001

#define _ADL1STAT_ADTDLY_POSITION                0x00000007
#define _ADL1STAT_ADTDLY_MASK                    0x00000080
#define _ADL1STAT_ADTDLY_LENGTH                  0x00000001

#define _ADL1STAT_LBUSY_POSITION                 0x0000000E
#define _ADL1STAT_LBUSY_MASK                     0x00004000
#define _ADL1STAT_LBUSY_LENGTH                   0x00000001

#define _ADL1STAT_ADTACT_POSITION                0x0000000F
#define _ADL1STAT_ADTACT_MASK                    0x00008000
#define _ADL1STAT_ADTACT_LENGTH                  0x00000001

#define _ADTH1L_TH0_POSITION                     0x00000000
#define _ADTH1L_TH0_MASK                         0x00000001
#define _ADTH1L_TH0_LENGTH                       0x00000001

#define _ADTH1L_TH1_POSITION                     0x00000001
#define _ADTH1L_TH1_MASK                         0x00000002
#define _ADTH1L_TH1_LENGTH                       0x00000001

#define _ADTH1L_TH2_POSITION                     0x00000002
#define _ADTH1L_TH2_MASK                         0x00000004
#define _ADTH1L_TH2_LENGTH                       0x00000001

#define _ADTH1L_TH3_POSITION                     0x00000003
#define _ADTH1L_TH3_MASK                         0x00000008
#define _ADTH1L_TH3_LENGTH                       0x00000001

#define _ADTH1L_TH4_POSITION                     0x00000004
#define _ADTH1L_TH4_MASK                         0x00000010
#define _ADTH1L_TH4_LENGTH                       0x00000001

#define _ADTH1L_TH5_POSITION                     0x00000005
#define _ADTH1L_TH5_MASK                         0x00000020
#define _ADTH1L_TH5_LENGTH                       0x00000001

#define _ADTH1L_TH6_POSITION                     0x00000006
#define _ADTH1L_TH6_MASK                         0x00000040
#define _ADTH1L_TH6_LENGTH                       0x00000001

#define _ADTH1L_TH7_POSITION                     0x00000007
#define _ADTH1L_TH7_MASK                         0x00000080
#define _ADTH1L_TH7_LENGTH                       0x00000001

#define _ADTH1L_TH8_POSITION                     0x00000008
#define _ADTH1L_TH8_MASK                         0x00000100
#define _ADTH1L_TH8_LENGTH                       0x00000001

#define _ADTH1L_TH9_POSITION                     0x00000009
#define _ADTH1L_TH9_MASK                         0x00000200
#define _ADTH1L_TH9_LENGTH                       0x00000001

#define _ADTH1L_TH10_POSITION                    0x0000000A
#define _ADTH1L_TH10_MASK                        0x00000400
#define _ADTH1L_TH10_LENGTH                      0x00000001

#define _ADTH1L_TH11_POSITION                    0x0000000B
#define _ADTH1L_TH11_MASK                        0x00000800
#define _ADTH1L_TH11_LENGTH                      0x00000001

#define _ADTH1L_TH12_POSITION                    0x0000000C
#define _ADTH1L_TH12_MASK                        0x00001000
#define _ADTH1L_TH12_LENGTH                      0x00000001

#define _ADTH1L_TH13_POSITION                    0x0000000D
#define _ADTH1L_TH13_MASK                        0x00002000
#define _ADTH1L_TH13_LENGTH                      0x00000001

