MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC006/mcu.h
#define _ADL2MSEL1_MSEL30_POSITION               0x0000000E
#define _ADL2MSEL1_MSEL30_MASK                   0x00004000
#define _ADL2MSEL1_MSEL30_LENGTH                 0x00000001

#define _ADL2MSEL1_MSEL31_POSITION               0x0000000F
#define _ADL2MSEL1_MSEL31_MASK                   0x00008000
#define _ADL2MSEL1_MSEL31_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL32_POSITION               0x00000000
#define _ADL2MSEL2_MSEL32_MASK                   0x00000001
#define _ADL2MSEL2_MSEL32_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL33_POSITION               0x00000001
#define _ADL2MSEL2_MSEL33_MASK                   0x00000002
#define _ADL2MSEL2_MSEL33_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL34_POSITION               0x00000002
#define _ADL2MSEL2_MSEL34_MASK                   0x00000004
#define _ADL2MSEL2_MSEL34_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL35_POSITION               0x00000003
#define _ADL2MSEL2_MSEL35_MASK                   0x00000008
#define _ADL2MSEL2_MSEL35_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL36_POSITION               0x00000004
#define _ADL2MSEL2_MSEL36_MASK                   0x00000010
#define _ADL2MSEL2_MSEL36_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL37_POSITION               0x00000005
#define _ADL2MSEL2_MSEL37_MASK                   0x00000020
#define _ADL2MSEL2_MSEL37_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL38_POSITION               0x00000006
#define _ADL2MSEL2_MSEL38_MASK                   0x00000040
#define _ADL2MSEL2_MSEL38_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL39_POSITION               0x00000007
#define _ADL2MSEL2_MSEL39_MASK                   0x00000080
#define _ADL2MSEL2_MSEL39_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL40_POSITION               0x00000008
#define _ADL2MSEL2_MSEL40_MASK                   0x00000100
#define _ADL2MSEL2_MSEL40_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL41_POSITION               0x00000009
#define _ADL2MSEL2_MSEL41_MASK                   0x00000200
#define _ADL2MSEL2_MSEL41_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL42_POSITION               0x0000000A
#define _ADL2MSEL2_MSEL42_MASK                   0x00000400
#define _ADL2MSEL2_MSEL42_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL43_POSITION               0x0000000B
#define _ADL2MSEL2_MSEL43_MASK                   0x00000800
#define _ADL2MSEL2_MSEL43_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL44_POSITION               0x0000000C
#define _ADL2MSEL2_MSEL44_MASK                   0x00001000
#define _ADL2MSEL2_MSEL44_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL45_POSITION               0x0000000D
#define _ADL2MSEL2_MSEL45_MASK                   0x00002000
#define _ADL2MSEL2_MSEL45_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL46_POSITION               0x0000000E
#define _ADL2MSEL2_MSEL46_MASK                   0x00004000
#define _ADL2MSEL2_MSEL46_LENGTH                 0x00000001

#define _ADL2MSEL2_MSEL47_POSITION               0x0000000F
#define _ADL2MSEL2_MSEL47_MASK                   0x00008000
#define _ADL2MSEL2_MSEL47_LENGTH                 0x00000001

#define _ADL2MSEL3_MSEL48_POSITION               0x00000000
#define _ADL2MSEL3_MSEL48_MASK                   0x00000001
#define _ADL2MSEL3_MSEL48_LENGTH                 0x00000001

#define _ADL2MSEL3_MSEL49_POSITION               0x00000001
#define _ADL2MSEL3_MSEL49_MASK                   0x00000002
#define _ADL2MSEL3_MSEL49_LENGTH                 0x00000001

#define _LCDREG_CKSEL_POSITION                   0x00000000
#define _LCDREG_CKSEL_MASK                       0x00000003
#define _LCDREG_CKSEL_LENGTH                     0x00000002

#define _LCDREG_MODE13_POSITION                  0x00000002
#define _LCDREG_MODE13_MASK                      0x00000004
#define _LCDREG_MODE13_LENGTH                    0x00000001

#define _LCDREG_BIAS_POSITION                    0x00000003
#define _LCDREG_BIAS_MASK                        0x00000038
#define _LCDREG_BIAS_LENGTH                      0x00000003

#define _LCDREG_CPEN_POSITION                    0x0000000F
#define _LCDREG_CPEN_MASK                        0x00008000
#define _LCDREG_CPEN_LENGTH                      0x00000001

#define _LCDREG_CKSEL0_POSITION                  0x00000000
#define _LCDREG_CKSEL0_MASK                      0x00000001
#define _LCDREG_CKSEL0_LENGTH                    0x00000001

#define _LCDREG_CKSEL1_POSITION                  0x00000001
#define _LCDREG_CKSEL1_MASK                      0x00000002
#define _LCDREG_CKSEL1_LENGTH                    0x00000001

#define _LCDREG_BIAS0_POSITION                   0x00000003
#define _LCDREG_BIAS0_MASK                       0x00000008
#define _LCDREG_BIAS0_LENGTH                     0x00000001

#define _LCDREG_BIAS1_POSITION                   0x00000004
#define _LCDREG_BIAS1_MASK                       0x00000010
#define _LCDREG_BIAS1_LENGTH                     0x00000001

#define _LCDREG_BIAS2_POSITION                   0x00000005
#define _LCDREG_BIAS2_MASK                       0x00000020
#define _LCDREG_BIAS2_LENGTH                     0x00000001

#define _LCDREF_LRLAT_POSITION                   0x00000000
#define _LCDREF_LRLAT_MASK                       0x00000007
#define _LCDREF_LRLAT_LENGTH                     0x00000003

#define _LCDREF_LRLBP_POSITION                   0x00000004
#define _LCDREF_LRLBP_MASK                       0x00000030
#define _LCDREF_LRLBP_LENGTH                     0x00000002

#define _LCDREF_LRLAP_POSITION                   0x00000006
#define _LCDREF_LRLAP_MASK                       0x000000C0
#define _LCDREF_LRLAP_LENGTH                     0x00000002

#define _LCDREF_VLCD1PE_POSITION                 0x00000008
#define _LCDREF_VLCD1PE_MASK                     0x00000100
#define _LCDREF_VLCD1PE_LENGTH                   0x00000001

#define _LCDREF_VLCD2PE_POSITION                 0x00000009
#define _LCDREF_VLCD2PE_MASK                     0x00000200
#define _LCDREF_VLCD2PE_LENGTH                   0x00000001

#define _LCDREF_VLCD3PE_POSITION                 0x0000000A
#define _LCDREF_VLCD3PE_MASK                     0x00000400
#define _LCDREF_VLCD3PE_LENGTH                   0x00000001

#define _LCDREF_LCDCST_POSITION                  0x0000000B
#define _LCDREF_LCDCST_MASK                      0x00003800
#define _LCDREF_LCDCST_LENGTH                    0x00000003

#define _LCDREF_LCDIRE_POSITION                  0x0000000F
#define _LCDREF_LCDIRE_MASK                      0x00008000
#define _LCDREF_LCDIRE_LENGTH                    0x00000001

